# InvalidElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementId..::..InvalidElementId Property
ElementId Class See Also
---
Get the invalid ElementId whose value is -1.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ElementId InvalidElementId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidElementId As ElementId
	Get
```

Visual C++
---
```text
public:
static property ElementId^ InvalidElementId {
	ElementId^ get ();
}
```

# See Also
ElementId Class
Autodesk.Revit.DB Namespace